var local_database = [
  {
    condition: "头晕",
    reason: "贫血、颈椎病、急性发热、胃肠炎、内分泌紊乱及神经官能症等均可引起头晕:\n 1． 贫血 老人如有头晕、乏力、面色苍白的表现，应去医院检查一下，看是否贫血。老年人如果不注意营养保健，很容易患贫血。此外，消化不良、消化性溃疡、消化道出血以及慢性炎症疾病的老年患者均可继发贫血。\n 2． 血粘度高 高血脂、血小板增多症等均可使血黏度高，血流缓慢，造成脑部供血足，发生容易疲倦、头晕、乏力等症状。其中造成高血脂的原因很多，最主要的是平时饮食结构的不和理。\n 3． 脑动脉硬化 患者自觉头晕，且经常失眠、耳鸣、情绪不稳、健忘、四肢发麻。脑动脉硬化使血管内径变小，脑内血流下降，产生脑供血、供氧不足，引起头晕。\n4． 颈椎病 常出现颈部发紧、灵活度受限、偶有疼痛、手指发麻、发凉，有沉重感。颈椎增生挤压颈部椎动脉，造成脑供血不足，是该病引起头晕的主要原因。\n 5． 高血压 高血压患者除头晕之外，还常伴随头胀、心慌、烦躁、耳鸣、失眠等不适。\n6． 心脏病 冠心病早期，有的人可能感觉头痛、头晕、四肢无力、精神不易集中等。主要是因心脏冠状动脉发生粥样硬化，造成供血不足而引起头晕。 对头晕最好的解决办法还是预防。老人应定期作血压、心音、心律，以及血常规、血脂、血黏度、脑电图、脑血流图、颈部x线等检查，防患于未然。"
  }, 
  {
    condition: "发烧",
    reason: "针对发热的病因进行积极的处理是解决发热的根本办法。例如:感染性发热，根据感染源不同选择有效药物进行治疗;脱水的患者积极进行补液;发生药物反应时立即停用药物并进行抗过敏治疗等。"
  }, 
  {
    condition: "肚子疼",
    reason: "情志内伤素体阳盛，加之恼怒过度，肝阳上亢，阳升风动，发为眩晕；或因长期忧郁恼怒，气郁化火，使肝阴暗耗，"
    + "肝阳上亢，阳升风动，上扰清空，发为眩晕。"
  },
   {
    condition: "心疼",
    reason: "情志内伤素体阳盛，加之恼怒过度，肝阳上亢，阳升风动，发为眩晕；或因长期忧郁恼怒，气郁化火，使肝阴暗耗，"
    + "肝阳上亢，阳升风动，上扰清空，发为眩晕。"
  },
   {
    condition: "发冷",
    reason: "情志内伤素体阳盛，加之恼怒过度，肝阳上亢，阳升风动，发为眩晕；或因长期忧郁恼怒，气郁化火，使肝阴暗耗，"
    + "肝阳上亢，阳升风动，上扰清空，发为眩晕。"
  },
  {
    condition:"身体无力",
    reason:"根据描述，可能是睡眠不好，引起身体乏力，没有精神。或者到医院检查一下是否有贫血或者低血压症状，平时注意合理健康饮食，作息规律，祝健康！" 
  }
]

module.exports = {
  postList: local_database
}
